import React from 'react';

const Answers = () => {
    return (
        <div className='mt-5 p-3'>
            <h4>প্রশ্ন-১ঃ রিয়াক্ট কিভাবে কাজ করে?</h4>
            <p>উত্তরঃ- <br/> <strong>রিয়াক্ট</strong> হচ্ছে কোম্পোনেন্ট based জাভাস্ক্রিপ্ট লাইব্রেরী। রিয়াক্ট ইউনিডিরেকশনাল ডাটা বাইন্ডিং ওয়ে তে কাজ করে। অর্থাৎ ডাটা উপর থেকে নিচের দিকে পাস করা যায়। আমরা যখন রিয়াক্ট দিয়ে কোনো ওয়েব অ্যাপ্লিকেশন বানাই তখন রিয়াক্ট রিয়েল ডমের মতো একটা ভার্চুয়াল ডম ক্রিয়েট করে ডিফ অ্যালগরিদমের মাধ্যমে। স্টেটে কিছু চেঞ্জ হলে সেটা কম্পেয়ার করে ডাটা রিরেন্ডার করে </p>
            <h4>প্রশ্ন-২ঃ প্রপ্স এবং স্টেটের মধ্যে পার্থক্য কি?</h4>
            <p>উত্তরঃ- <br/> <strong>প্রপ্সঃ</strong> প্রপ্স এর কাজ হলো এক কম্পোনেন্ট থেকে অন্য কম্পোনেন্টে ডাটা পাস করা।<br/> 
            <strong> স্টেটঃ</strong> স্টেটে ডাটা স্টোর করে শুধু লোকালি অর্থাৎ নিজ কম্পোনেন্টে ইউজ করা যায় কিন্তু অন্য কোনো কম্পোনেন্টে পাস করা যায়না।
            </p>

        </div>
    );
};

export default Answers;